app/Http/Controllers/TheLoaiController.php

select * from `TheLoai`
---
    public function getDanhSach()
    {
        $DStheloai = TheLoai::simplePaginate(8);;

insert into `TheLoai` (`Ten`, `TenKhongDau`, `updated_at`, `created_at`) values ('Kinh doanh', 'kinh-doanh', '2017-11-23 15:30:16', '2017-11-23 15:30:16')
---
    public function postThem(TheLoaiRequest $request)
    {
        // $this->validate($request,
        //     [
        //         'name' => 'required|min:3|max:100|unique:TheLoai,Ten'
        //     ],
        //     [
        //         'name.required'=>'Ban chua nhap ten the loai',
        //         'name.min'=> 'Ten the loai phai co do dai tu 3 cho den 100 ky tu',
        //         'name.unique'=>'Ten da ton tai'
        //     ]);
        $theloai = new TheLoai;
        $theloai->Ten = $request->get('name');
        $theloai->TenKhongDau = changeTitle($request->get('name'));
        $theloai->save();

select * from `TheLoai` where `TheLoai`.`id` = '1' limit 1
---
    public function getSua($id)
    {
        $theloai = TheLoai::find($id);

select * from `TheLoai` where `TheLoai`.`id` = '1' limit 1
update `TheLoai` set `Ten` = 'Đời sống và xã hội', `TenKhongDau` = 'doi-song-va-xa-hoi', `updated_at` = '2017-11-23 15:31:23' where `id` = '1'
---
    public function postSua(TheLoaiRequest $request, $id)
    {
        $theloai = TheLoai::find($id);
        // $this->validate($request,
        //     [
        //         'name'=>'required|min:3|max:100|unique:TheLoai,Ten'
        //     ],
        //     [
        //         'name.required'=>'Ban chua nhap ten the loai',
        //         'name.min'=>'Ten the loai phai co do dai tu 3 cho den 100 ky tu',
        //         'name.max'=>'Ten the loai phai co do dai tu 3 cho den 100 ky tu',
        //         'name.unique'=>'Ten da ton tai'
        //     ]);
        $theloai->Ten = $request->get('name');
        $theloai->TenKhongDau = changeTitle($request->get('name'));
        $theloai->save();

select * from `TheLoai` where `TheLoai`.`id` = '7' limit 1
delete from `TheLoai` where `id` = '7'
---
    public function getXoa($id)
    {
        $theloai = TheLoai::find($id);
        $theloai->delete();